#+Title: NES TODO LIST
#+subtitle: And quick notes for faster daily reuptake.

* v0.1 : "CPU"
** DONE [100%] v0.0.0
*** DONE Basic File Structure
CLOSED: [2018-11-18 Sun 12:37]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:37]
*** DONE Basic CPU Struct/IMPL
CLOSED: [2018-11-18 Sun 12:37]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:37]
**** DONE test_new()
*** DONE Addressing Modes
CLOSED: [2018-11-18 Sun 12:37]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:37]
**** DONE test_AM()
** DONE [100%] v0.1.0
*** DONE Flags
**** DONE test_status_each()
**** DONE test_status_settingtwice()
*** DONE Basic Memory/Registers
**** DONE test_new_memory()
*** DONE CLC, CLD, CLI, CLV, SEC, SED, SEI.
**** DONE testOP_flags()
*** DONE LDA
**** DONE testOP_LDA()
*** DONE LDX
**** DONE testOP_LDX()
*** DONE LDY
CLOSED: [2018-11-18 Sun 12:38]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:38]
**** DONE testOP_LDY()
** DONE [100%] v0.1.1 : "Primary Arithmetic Operations"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
:LOGBOOK:
CLOCK: [2018-11-19 Mon 12:10]--[2018-11-19 Mon 13:05] =>  0:55
:END:
*** DONE ADC : "Add with Carry"
CLOSED: [2018-11-19 Mon 09:59]
- State "DONE"       from "TODO"       [2018-11-19 Mon 09:59]
**** DONE testOP_ADC()
CLOSED: [2018-11-18 Sun 10:42]
- State "DONE"       from "TODO"       [2018-11-18 Sun 10:42]
**** DONE testOP_ADC_signed()
CLOSED: [2018-11-18 Sun 12:12]
- State "DONE"       from "TODO"       [2018-11-18 Sun 12:12]
:LOGBOOK:
CLOCK: [2018-11-18 Sun 10:51]--[2018-11-18 Sun 12:06] =>  1:15
:END:
**** WAIT testOP_ADC_decimal()
CLOSED: [2018-11-19 Mon 09:58]
- State "WAIT"       from              [2018-11-19 Mon 09:58] \\
  See documentation on issue #1, or src/core/cpu_test.rs::testOP_ADC_decimal().
*** DONE SBC : "Subtract with Borrow"
CLOSED: [2018-11-19 Mon 11:39]
- State "DONE"       from "TODO"       [2018-11-19 Mon 11:39]
**** DONE testOP_SBC()
CLOSED: [2018-11-19 Mon 11:38]
- State "DONE"       from "TODO"       [2018-11-19 Mon 11:38]
**** DONE testOP_SBC_signed()
CLOSED: [2018-11-19 Mon 11:38]
- State "DONE"       from "TODO"       [2018-11-19 Mon 11:38]
**** WAIT testOP_SBC_decimal()
CLOSED: [2018-11-19 Mon 11:38]
- State "WAIT"       from              [2018-11-19 Mon 11:38] \\
  Same as [[testOP_ADC_decimal()]]...
*** DONE AND : "Bitwise AND with Accumulator"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
**** DONE testOP_AND()
CLOSED: [2018-11-19 Mon 12:03]
- State "DONE"       from "TODO"       [2018-11-19 Mon 12:03]
*** DONE EOR : "Bitwise Exclusive OR with Accumulator"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
**** DONE testOP_EOR()
CLOSED: [2018-11-19 Mon 12:10]
- State "DONE"       from "TODO"       [2018-11-19 Mon 12:10]
:LOGBOOK:
CLOCK: [2018-11-19 Mon 12:03]--[2018-11-19 Mon 12:10] =>  0:07
:END:
*** DONE ORA : "Bitwise OR with Accumulator"
CLOSED: [2018-11-19 Mon 13:05]
- State "DONE"       from "TODO"       [2018-11-19 Mon 13:05]
**** DONE testOP_ORA()
CLOSED: [2018-11-19 Mon 12:10]
- State "DONE"       from "TODO"       [2018-11-19 Mon 12:10]
** TODO [0%] v0.1.2 : "Bit Manipulation"
*** TODO ASL : "Arithmatic Shift Left"
Refer to 10.5 in KIM guide.
**** TODO testOP_ASL
*** TODO LSR : "Logical Shift Right"
**** TODO testOP_LSR
*** TODO ROL : "Rotate Left"
**** TODO testOP_ROL
*** TODO ROR : "Rotate Right"
**** TODO testOP_ROR
** TODO [0%] v0.1.3 : "Register/Memory Manipulation"
*** TODO DEC : "Increment Memory By One"
**** TODO testOP_DEC
*** TODO DEX : "Decrement Index Register X by One"
**** TODO testOP_DEX
*** TODO DEY : "Decrement Index Register Y by One"
**** TODO testOP_DEY
*** TODO INC : "Increment Memory By One"
**** TODO testOP_INC
*** TODO INX : "Increment Index Register X by One"
**** TODO testOP_INX
*** TODO INY : "Increment Index Register Y by One"
**** TODO testOP_INY
*** TODO STA : "Store Accumulator in Memory"
**** TODO testOP_STA
*** TODO STX : "Store Index Register X in Memory"
**** TODO testOP_STX
*** TODO STY : "Store Index Register Y in Memory"
**** TODO testOP_STY
*** TODO TAX : "Transfer Accumulator to Index X"
**** TODO testOP_TAX
*** TODO TAY : "Transfer Accumulator to Index Y"
**** TODO testOP_TAY
*** TODO TSX : "Transfer Stack Pointer to Index"
**** TODO testOP_TSX
*** TODO TXA : "Transfer Index X to Accumulator"
**** TODO testOP_TXA
*** TODO TXS : "Transfer Index X to Stack Pointer"
**** TODO testOP_TXS
*** TODO TYA : "Transfer Index Y to Accumulator"
**** TODO testOP_TYA
** TODO [0%] v0.1.4 : "General Operations"
** TODO [0%] v0.1.5 : "Stack Manipulation"
** TODO [0%] v0.1.6 : "Comparators"
** TODO [0%] v0.1.7 : "Branching/Jumping"
* v0.2 : "Memory"
* v0.3 : "PPU"
* Notes
//[1]	0: carry flag
//	1: zero flag
//  	2: interrupt disable flag
//  	3: decimal mode flag
//  	4: break command flag
//  	5: unused flag
//  	6: overflow flag
//  	7: negative flag
//
//[3] 	izx = indexed indirect =  12
//    	izy = indirect indexed = 11
//    	ind = indirect = 10
//    	zp = zero page = 3
//    	zpx = zero page x = 4
//    	zpy = zero page y = 5
//    	abs = absolute val = 6
//    	abx = absolute val x = 7 
//    	aby = absolute val y = 8
//    	imm = immediate = 2
//    	rel = relative = 9
